/* Application */
"APP_TITLE" = "cocoaDialog";
"APP_NAME" = "cocoadialog";

/* General */
"CANCEL" = "Cancel";
"NO" = "No";
"OK" = "Ok";
"NOTE" = "Note";
"OKAY" = "Okay";
"OPTION_EMPTY_TEXT" = "An input is required, please try again.";
"WARNING" = "Warning";
"YES" = "Yes";

/* Logging */
"LOG_DEBUG"   = "[DEBUG]   ";
"LOG_ERROR"   = "[ERROR]   ";
"LOG_WARNING" = "[WARNING] ";
"LOG_VERBOSE" = "[VERBOSE] ";

/* Warning messages */
"UNKNOWN_OPTION" = "Unknown option: %@";

/* Usage */
"USAGE" = "Usage: cocoadialog %@ [options]";
"USAGE_CATEGORY_CONTROLS" = "Controls";
"USAGE_CATEGORY_CONTROL" = "Control options";
"USAGE_VERBOSE_OUTPUT" = "Use %@ to display additional information.";
"USAGE_VERSION" = "Version";
"USAGE_WEBSITE" = "Website";

/* Option types */
"OPTION_TYPE_BOOLEAN" = "boolean";
"OPTION_TYPE_NUMBER" = "number";
"OPTION_TYPE_STRING" = "string";

/* Option verbiage */
"OPTION_AUTOMATIC_DEFAULT_VALUE" = "Automatic";
"OPTION_DEFAULT_VALUE" = "Default value: %@";
"OPTION_MULTIPLE_DOUBLE_DASH" = "Append a double dash (--) after all values have been provided to indicate that values should stop being parsed.";
"OPTION_REQUIRED_VALUE" = "Required";

/* OPTION WARNINGS */
"OPTION_WARNING_AFFECTS_OUTPUT" = "Using this option will affect the control output and should not be used in stable code.";

/* Global Options */
"GLOBAL_OPTION" = "Global options";
"GLOBAL_OPTION_COLOR" = "Colorize ouput. By default, this is automatically determined by whether the terminal supports color or not.";
"GLOBAL_OPTION_DEBUG" = "Enables debug oriented output to help troubleshoot possible issues with a control.";
"GLOBAL_OPTION_HELP" = "Displays this help.";
"GLOBAL_OPTION_NO_NEWLINE" = "Prevents appending a newline character to the control result value.";
"GLOBAL_OPTION_NO_WARNINGS" = "Prevents any warning messages that may affect the control result value.";
"GLOBAL_OPTION_OUTPUT" = "@todo";
"GLOBAL_OPTION_QUIET" = "Silences all output.";
"GLOBAL_OPTION_SCREEN" = "Indicates on which screen the control will appear. By default, the screen that currently has keyboard focus is used.";
"GLOBAL_OPTION_STRING_OUTPUT" = "Returns text values of input elements rather than their numerical index.";
"GLOBAL_OPTION_TIMEOUT" = "Number of seconds the control should wait for user input before timing out.";
"GLOBAL_OPTION_TIMEOUT_FORMAT" = "Sets the timeout format used to display the remaining time. Provided replacement tokens include: %r (relative), %d (day), %h (hour), %m (minute) and %s (second).";
"GLOBAL_OPTION_VERBOSE" = "Enables verbose oriented output to help troubleshoot possible issues with a control.";
"GLOBAL_OPTION_VERSION" = "Outputs the current version and then immediately exits.";

/* Icon options */
"ICON_OPTION" = "Icon options";
"ICON_OPTION_ICON" = "Name of the icon to use. See website for full list.";
"ICON_OPTION_ICON_BUNDLE" = "Name of the bundle to load icon from.";
"ICON_OPTION_ICON_FILE" = "Filename of an icon or image to use.";
"ICON_OPTION_ICON_HEIGHT" = "Height of the icon.";
"ICON_OPTION_ICON_SIZE" = "Unified height and width of icon. Can be one of: 16, 32, 48, 128, 256.";
"ICON_OPTION_ICON_TYPE" = "File extension type to use. Defaults to \"icns\"";
"ICON_OPTION_ICON_WIDTH" = "Width of the icon.";

/* Window options */
"WINDOW_OPTION" = "Window options";
"WINDOW_OPTION_HEIGHT" = "Height of the control.";
"WINDOW_OPTION_NO_FLOAT" = "Prevents the control from always showing. WARNING: disabling this may cause the control to become difficult to manage.";
"WINDOW_OPTION_MAX_HEIGHT" = "Maximum height for the control.";
"WINDOW_OPTION_MAX_WIDTH" = "Maximum width for the control.";
"WINDOW_OPTION_MIN_HEIGHT" = "Minimum height for the control.";
"WINDOW_OPTION_MIN_WIDTH" = "Minimum width for the control.";
"WINDOW_OPTION_POSX" = "The horizontal position of the control. Possible values are: \"left\", \"center\", \"right\" or a <number> in pixels.";
"WINDOW_OPTION_POSY" = "The vertical position of the control. Possible values are: \"top\", \"center\", \"bottom\" or a <number> in pixels.";
"WINDOW_OPTION_RESIZE" = "Allows the control to be resizeable.";
"WINDOW_OPTION_TITLE" = "Label to use in the titlebar of the control.";
"WINDOW_OPTION_TITLEBAR_CLOSE" = "Enables the close titlebar button.";
"WINDOW_OPTION_TITLEBAR_MINIMIZE" = "Enables the minimize titlebar button.";
"WINDOW_OPTION_TITLEBAR_ZOOM" = "Enables the zoom (resize) titlebar button.";
"WINDOW_OPTION_WIDTH" = "Width of the control.";

/* TBC (three button control) options */
"WINDOW_OPTION_LABEL" = "Text to be displayed at the top of the control.";
"WINDOW_OPTION_BUTTON1" = "Text to be displayed as the first button.";
"WINDOW_OPTION_BUTTON2" = "Text to be displayed as the second button.";
"WINDOW_OPTION_BUTTON3" = "Text to be displayed as the third button.";
"WINDOW_OPTION_CANCEL" = "Specifies which button should be used as the \"Cancel\" button (e.g. --cancel \"Custom button\"). The value provided can either be the text of one of the provided buttons or the numerical button index, where --button1 is 0.";
"WINDOW_OPTION_NO_DEFAULT_BUTTON" = "Flag indicating that --button1 will not automatically be focused and requires manual use input.";
"WINDOW_OPTION_VALUE_REQUIRED" = "Flag indicating that a value is required from the user before the control is able to close.";
"WINDOW_OPTION_EMPTY_TEXT" = "The text to display to the user when --value-required has been set and user has not provided input.";

/* Checkbox options */
"_CHECKBOX_OPTIONS" = "Checkbox options";
"_CHECKBOX_OPTIONS_CHECKED" = "List of item indices where the \"checked\" state should be enabled.";
"_CHECKBOX_OPTIONS_COLUMNS" = "Number of columns the checkboxes should fit into.";
"_CHECKBOX_OPTIONS_DISABLED" = "List of item indices where the \"disabled\" state should be enabled.";
"_CHECKBOX_OPTIONS_ITEMS" = "List of checkbox items. The first item's index is 0, the second is 1 and so forth.";
"_CHECKBOX_OPTIONS_MIXED" = "List of item indices where the \"mixed\" state should be enabled.";
"_CHECKBOX_OPTIONS_ROWS" = "Number of rows the checkboxes should fit into.";

/* File based controls */
"CONTROL_OPTIONS_CREATE_DIRECTORIES" = "Allows the creation of directories.";
"CONTROL_OPTIONS_PACKAGES_AS_DIRECTORIES" = "Allows the traversal of package files (.app, .bundle, .pkg, etc.) like directories.";
"CONTROL_OPTIONS_WITH_EXTENSIONS" = "A space separated list of extensions.";
"CONTROL_OPTIONS_WITH_DIRECTORY" = "The directory in which to start the control in.";
"CONTROL_OPTIONS_WITH_FILE" = "The initial file to select control opens.";

/* msgbox */
"CONTROL_OPTIONS_ALERT" = "Bolded text to be displayed above --label.";

/* progressbar */
"PROGRESS_BAR_STOP_QUESTION" = "Are you sure you want to stop?";
"PROGRESS_BAR_STOP_BUTTON" = "Stop";

/* slider  */
"SLIDER_DEFAULT_LABEL" = "Choose a value:";
